{
  "basics": {
    "name": "Kevin Westropp",
    "label": "Software Engineering Team Lead at Tipico",
    "image": "https://avatars.githubusercontent.com/u/2483268?v=4",
    "email": "mail@kevinpatrickwestropp.com",
    "phone": "",
    "url": "https://www.kevinpatrickwestropp.com",
    "summary": "Experienced software engineer and front-end developer with a proven track record in leading teams, coordinating projects, mentoring developers, and enhancing user experiences. Proficient in various technologies including React, Vue.js, JavaScript, HTML, CSS, and TypeScript. Holds a Master's degree in Computer Science and has a strong commitment to delivering high-quality code and optimizing performance. Also actively involved in volunteer work, mentoring students and contributing to environmental initiatives.",
    "profiles": [
      {
        "network": "gitconnected",
        "username": "highlanderkev",
        "url": "https://gitconnected.com/highlanderkev"
      },
      {
        "network": "GitHub",
        "username": "highlanderkev",
        "url": "https://github.com/highlanderkev"
      },
      {
        "network": "LinkedIn",
        "url": "https://www.linkedin.com/in/kevinpatrickwestropp/",
        "username": "kevinpatrickwestropp"
      }
    ],
    "headline": "Developer",
    "blog": null,
    "yearsOfExperience": 10,
    "username": "highlanderkev",
    "locationAsString": "Denver, Colorado",
    "region": "Denver, Colorado",
    "karma": 12,
    "id": "95c3e10f-65ae-4e58-bda1-67e6f45720d0",
    "followers": 26,
    "following": 46,
    "picture": "https://avatars.githubusercontent.com/u/2483268?v=4",
    "website": "https://www.kevinpatrickwestropp.com"
  },
  "skills": [
    {
      "name": "Front-End/Web Development",
      "level": "Expert",
      "keywords": [
        "HTML",
        "CSS",
        "JavaScript",
        "TypeScript",
        "jQuery",
        "SCSS/SASS",
        "Less",
        "XML"
      ],
      "rating": 0,
      "yearsOfExperience": 8
    },
    {
      "name": "Web Application Development",
      "level": "Expert",
      "keywords": [
        "React",
        "Redux",
        "Next.js",
        "Angular",
        "Vue",
        "Nuxt",
        "Ruby on Rails",
        "Django",
        "Backbone.js",
        "Web2py",
        "Node.js"
      ],
      "rating": 0,
      "yearsOfExperience": 8
    },
    {
      "name": "Software Development",
      "level": "Expert",
      "keywords": [
        "JavaScript",
        "TypeScript",
        "Python",
        "Java",
        "Dart",
        "Golang",
        "Scala"
      ],
      "rating": 0,
      "yearsOfExperience": 8
    },
    {
      "name": "Agile Project Management",
      "level": "Advanced",
      "keywords": [
        "Scrum",
        "Kanban",
        "Jira"
      ],
      "rating": 0,
      "yearsOfExperience": 7
    },
    {
      "name": "DevOps",
      "level": "Advanced",
      "keywords": [
        "Git",
        "Github Actions",
        "Jenkins",
        "CircleCI"
      ],
      "rating": 0,
      "yearsOfExperience": 6
    },
    {
      "name": "Cloud Development",
      "level": "Advanced",
      "keywords": [
        "Microsoft Azure",
        "Amazon Web Services (AWS)",
        "Google Cloud Platform (gcp)",
        "Firebase"
      ],
      "rating": 0,
      "yearsOfExperience": 5
    },
    {
      "name": "API Development",
      "level": "Advanced",
      "keywords": [
        ".NET",
        "Dart",
        "Node.js",
        "Golang",
        "Java",
        "Python",
        "Express.js",
        "TypeScript",
        "GraphQL"
      ],
      "rating": 0,
      "yearsOfExperience": 5
    },
    {
      "name": "Test Driven Development",
      "level": "Advanced",
      "keywords": [
        "Mocha",
        "Jest",
        "JUnit",
        "Chai",
        "Jasmine",
        "Karma",
        "Puppeteer",
        "Selenium"
      ],
      "rating": 0,
      "yearsOfExperience": 5
    },
    {
      "name": "Back-End/Database Development",
      "level": "Advanced",
      "keywords": [
        "SQL",
        "PostgreSQL",
        "MySQL",
        "NoSQL",
        "MongoDB"
      ],
      "rating": 0,
      "yearsOfExperience": 5
    },
    {
      "name": "Network Programming",
      "level": "Advanced",
      "keywords": [
        "Java",
        "Scala"
      ],
      "rating": 0,
      "yearsOfExperience": 4
    },
    {
      "name": "Data Science",
      "level": "Intermediate",
      "keywords": [
        "R",
        "Python"
      ],
      "rating": 0,
      "yearsOfExperience": 3
    }
  ],
  "projects": [],
  "work": [
    {
      "name": "Tipico",
      "location": "Denver, CO",
      "description": "",
      "position": "Software Engineering Team Lead",
      "url": "https://www.tipico.com/",
      "startDate": "2022-02-01",
      "date": "2022-02-01",
      "summary": "Tools & Technology: React, Redux, Typescript, JavaScript, Node.js, Express.js, EJS, Mixpanel, GTM, Docker, Kubernetes",
      "highlights": [
        "Lead a talented UX Development team in the design and development of the main sportsbook application, contributing to enhanced user experiences and increased customer engagement.",
        "Collaborate closely with stakeholders, product owners, developers, designers, and analysts to coordinate project requirements and ensure successful delivery of software solutions.",
        "Mentor and guide developers, fostering their growth in programming skills and methodologies to improve overall team performance.",
        "Drive the creation of innovative UX designs that elevate the user experience across various applications, including the sportsbook, portal, and casino.",
        "Conduct comprehensive reviews of front-end designs and code development to maintain high quality standards and optimize performance.",
        "Partner with Quality Assurance Engineers to expand the robustness of the testing suite, ensuring consistent regression testing and minimal customer issues.",
        "Work closely with the Infrastructure team to enhance the Continuous Integration/Continuous Deployment (CICD) pipeline, enabling streamlined and efficient development processes.",
        "Provide valuable insights and contribute to the engineering hiring process, improving talent acquisition efforts and ensuring the recruitment of top-notch professionals.",
        "Collaborate with Product Management on team capacity planning, facilitating resource allocation and optimizing project execution.",
        "Monitor and investigate performance degradation, proactively identifying and resolving issues to optimize application performance."
      ],
      "isCurrentRole": true,
      "start": {
        "year": 2022,
        "month": 2
      },
      "end": {},
      "company": "Tipico",
      "website": "https://www.tipico.com/"
    },
    {
      "name": "Brinks Home Security",
      "location": "Denver, CO",
      "description": "",
      "position": "Lead Front-End Engineer",
      "url": "https://brinkshome.com/",
      "startDate": "2020-10-01",
      "endDate": "2022-02-01",
      "summary": "Tools & Technology: HTML, CSS, Sass, Bootstrap, JavaScript, TypeScript, Vue.js, NuxtJS, Webpack, Contentful, jQuery, Ruby on Rails, Spree, Hubspot, Google Tag Manager, Google Analytics, Jira, Github, Heroku",
      "highlights": [
        "Led the UX Development team responsible for all marketing-related activities, ensuring seamless and engaging user experiences.",
        "Coordinated project requirements among stakeholders, developers, consultants, designers, and analysts, ensuring effective collaboration and timely project delivery.",
        "Mentored and guided fellow developers, fostering their growth in UX skills and methodologies to enhance the overall capabilities of the team.",
        "Developed and implemented new UX designs that streamlined processes and elevated the user experience across various touchpoints.",
        "Collaborated with IT teams to build infrastructure and workflows for automating customer lifecycles, resulting in improved efficiency and customer satisfaction.",
        "Conducted comprehensive reviews of front-end designs and code development to uphold quality standards and optimize performance.",
        "Championed performance improvements across different tech stacks, identifying areas for optimization and implementing relevant enhancements.",
        "Acted as the technical point of contact for new UX rebranding efforts, ensuring successful execution and alignment with business objectives.",
        "Managed production and DevOps for all front-end code changes, ensuring smooth deployment and minimizing disruptions.",
        "Performed code reviews for front-end code changes, maintaining code quality and adhering to best practices.",
        "Utilized AWS, Heroku, Git, and other Saas applications as a cloud architect to host and maintain the brinkshome.com domain and subdomains.",
        "Managed analytics tracking of user interactions on the site and maintained Google Tag Manager (GTM) tags to ensure accurate data collection."
      ],
      "isCurrentRole": false,
      "start": {
        "year": 2020,
        "month": 10
      },
      "end": {
        "year": 2022,
        "month": 2
      },
      "company": "Brinks Home Security",
      "website": "https://brinkshome.com/"
    },
    {
      "name": "Brinks Home Security",
      "location": "Chicago, IL",
      "description": "",
      "position": "Senior Front-End Engineer",
      "url": "https://brinkshome.com/",
      "startDate": "2018-11-01",
      "endDate": "2020-10-01",
      "summary": "Tools & Technology: HTML, CSS, Sass, Bootstrap, JavaScript, TypeScript, Vue.js, NuxtJS, Webpack, Contentful, jQuery, Ruby on Rails, Spree, Hubspot, Google Tag Manager, Google Analytics, Jira, Github, Heroku",
      "highlights": [
        "Developed front-end website components using Vue.js, HTML, CSS, and JavaScript/TypeScript, delivering high-quality and visually appealing user interfaces.",
        "Successfully migrated legacy jQuery code to a Vue.js-based implementation, improving code maintainability and enhancing performance.",
        "Assisted in setting up and guiding the content authoring solution for marketing, contributing to the establishment of efficient content management practices.",
        "Facilitated the migration of legacy Ruby on Rails platforms to a new static web platform powered by Nuxt.js, Contentful, and Netlify, ensuring a modern and scalable architecture.",
        "Played a key role in architecting the custom content modeling integration with the front-end system, utilizing Contentful, Nuxt.js, and Netlify to streamline content delivery and enhance user experiences.",
        "Conducted code reviews to ensure adherence to high-quality standards, optimizing code efficiency and maintainability.",
        "Collaborated closely with UX designers, translating design concepts into functional front-end code and markup.",
        "Diagnosed and resolved bugs across the technical stack, ensuring smooth and error-free user experiences.",
        "Mentored and guided other developers in front-end development, sharing best practices and fostering a collaborative and growth-oriented team environment.",
        "Managed projects from ideation through implementation, ensuring timely delivery and alignment with project goals and objectives.",
        "Served as a brand and UI ambassador to other development teams within the organization, promoting consistent design and user interface standards."
      ],
      "isCurrentRole": false,
      "start": {
        "year": 2018,
        "month": 11
      },
      "end": {
        "year": 2020,
        "month": 10
      },
      "company": "Brinks Home Security",
      "website": "https://brinkshome.com/"
    },
    {
      "name": "TransUnion",
      "location": "Chicago, IL",
      "description": "",
      "position": "Senior UI Developer, Senior Consultant",
      "url": "https://www.transunion.com/",
      "startDate": "2018-05-01",
      "endDate": "2018-11-01",
      "summary": "Tools & Technology: HTML, CSS, Sass, JavaScript, TypeScript, Angular, Webpack, Web Components, Polymer",
      "highlights": [
        "Built new consumer marketing web pages using HTML, CSS, Sass, JavaScript, and TypeScript, incorporating best-in-class development techniques to enhance user experiences.",
        "Improved UI designs and optimized front-end code, resulting in visually appealing and performant websites.",
        "Focused on performance improvements and optimizations across all TransUnion websites, ensuring fast and seamless user interactions.",
        "Assisted in implementing process improvements and optimized development workflows, enhancing efficiency and productivity.",
        "Helped the team integrate Agile methodology into existing workflows, promoting iterative development and effective project management.",
        "Mentored other developers by conducting code reviews and providing guidance on high-level designs, fostering a culture of continuous learning and growth.",
        "Acted as the Product Owner for the site-wide CMS solution, driving the implementation and management of the content management system to streamline content delivery."
      ],
      "isCurrentRole": false,
      "start": {
        "year": 2018,
        "month": 5
      },
      "end": {
        "year": 2018,
        "month": 11
      },
      "company": "TransUnion",
      "website": "https://www.transunion.com/"
    },
    {
      "name": "Accenture",
      "location": "Chicago, IL",
      "description": "",
      "position": "Senior Front End Developer, Front End Development Consultant",
      "url": "https://www.accenture.com/",
      "startDate": "2017-07-01",
      "endDate": "2018-05-01",
      "summary": "Tools & Technology: HTML, CSS, Sass, JavaScript, Angular, Node.js, Express.js, Azure, AWS",
      "highlights": [
        "Collaborated with clients to build new single-page web applications using AngularJS, delivering solutions that met their specific requirements and objectives.",
        "Conducted comprehensive code reviews for both external and internal developers, ensuring adherence to high-quality standards and best practices.",
        "Leveraged extensive knowledge of web standards and best practices to optimize new projects, improving performance and user experiences.",
        "Demonstrated expertise in front-end development, utilizing HTML, CSS, Sass, JavaScript, Angular, Node.js, Express.js, Azure, and AWS to develop robust and scalable applications."
      ],
      "isCurrentRole": false,
      "start": {
        "year": 2017,
        "month": 7
      },
      "end": {
        "year": 2018,
        "month": 5
      },
      "company": "Accenture",
      "website": "https://www.accenture.com/"
    },
    {
      "name": "Egencia, an Expedia company",
      "location": "Chicago, IL",
      "description": "",
      "position": "Software Development Engineer II",
      "url": "https://www.egencia.com/",
      "startDate": "2016-06-01",
      "endDate": "2017-07-01",
      "summary": "Tools & Technology: HTML, CSS, LESS, JavaScript, jQuery, Backbone.js, Handlebars.js, Mocha, Selenium, C++, Java, Spring Boot, Maven, AWS",
      "highlights": [
        "Utilized agile methodology for the development of the new Egencia Global Home Page, ensuring efficient and iterative development processes.",
        "Developed the new Fusion Global Home Page using Java Spring to replace a legacy C++ application, improving scalability and maintainability.",
        "Leveraged expertise in Backbone.js, Handlebars.js, and ECMAScript 2016 to implement a new front-end design for the Global Home Page, enhancing user experiences.",
        "Wrote new backend Java services to support the development of the new client-side application, ensuring seamless integration and functionality.",
        "Played a key role in expanding automation and CICD (Continuous Integration and Continuous Deployment) practices, facilitating faster iteration of features and increasing the robustness of the development workflow.",
        "Demonstrated proficiency in a diverse technology stack, including HTML, CSS, LESS, JavaScript, jQuery, Backbone.js, Handlebars.js, Mocha, Selenium, C++, Java, Spring Boot, Maven, and AWS."
      ],
      "isCurrentRole": false,
      "start": {
        "year": 2016,
        "month": 6
      },
      "end": {
        "year": 2017,
        "month": 7
      },
      "company": "Egencia, an Expedia company",
      "website": "https://www.egencia.com/"
    },
    {
      "name": "kCura",
      "location": "Chicago, IL",
      "description": "",
      "position": "Software Engineer",
      "url": "https://www.relativity.com/",
      "startDate": "2014-08-01",
      "endDate": "2016-05-01",
      "summary": "Tools & Technology: HTML, CSS, JavaScript, jQuery, .NET, C#, SQL, Angular.js, C++, ASP.NET, Visual Basic, LINQ",
      "highlights": [
        "Developed across the full software stack to expand software functionality and implement new features, utilizing C++, C#, Visual Basic, JavaScript, jQuery, and SQL.",
        "Leveraged expertise in MVC, COM, CLR, WebForms, AngularJS, and ASP.NET to extend and enhance the software's capabilities.",
        "Worked within an agile methodology, collaborating with a small team to deliver high-quality software solutions.",
        "Contributed to the development of UI data visualization widgets using AngularJS, D3.js, and C3.js, enabling advanced analytics review.",
        "Designed endpoints and logic for a PDF printing framework, allowing users to save documents as PDFs in bulk as part of a recent software release.",
        "Refactored and extended processing software to handle MS Office Field Codes during document imaging, providing clients with multiple output options.",
        "Implemented a new UI framework leveraging AngularJS, delivering a more robust and feature-rich experience for Relativity users."
      ],
      "isCurrentRole": false,
      "start": {
        "year": 2014,
        "month": 8
      },
      "end": {
        "year": 2016,
        "month": 5
      },
      "company": "kCura",
      "website": "https://www.relativity.com/"
    },
    {
      "name": "savvo digital sommelier solutions",
      "location": "Chicago, IL",
      "description": "",
      "position": "Software Developer Intern",
      "url": "",
      "startDate": "2014-02-01",
      "endDate": "2014-05-01",
      "summary": "Tools & Technology: HTML, CSS, JavaScript, C#, .NET, jQuery",
      "highlights": [
        "Updated the front-end design and functionality of the main ASP.NET web application, improving the user experience and overall appearance.",
        "Refactored existing codebase to enhance maintainability and scalability.",
        "Programmed new designs using HTML, CSS, JavaScript, jQuery, and C#, ensuring adherence to best practices and coding standards.",
        "Collaborated with team members to troubleshoot and resolve issues, ensuring smooth operation of the web application."
      ],
      "isCurrentRole": false,
      "start": {
        "year": 2014,
        "month": 2
      },
      "end": {
        "year": 2014,
        "month": 5
      },
      "company": "savvo digital sommelier solutions",
      "website": ""
    },
    {
      "name": "TransUnion",
      "location": "",
      "description": "",
      "position": "Product Design and QA Intern",
      "url": "https://www.transunion.com/",
      "startDate": "2013-06-01",
      "endDate": "2013-09-01",
      "summary": "Tools & Technology: iOS, Objective-C, Swift, HTML, CSS, Perl, JavaScript, Java",
      "highlights": [
        "Developed an iPhone application for internal server process monitoring and tracking, enhancing efficiency and productivity.",
        "Updated and added functionality to backend web monitoring applications using JavaScript, HTML, and CSS, improving performance and user experience.",
        "Tested and wrote documentation for the roll-out of a proprietary content delivery network (CDN), ensuring smooth integration and utilization for international websites."
      ],
      "isCurrentRole": false,
      "start": {
        "year": 2013,
        "month": 6
      },
      "end": {
        "year": 2013,
        "month": 9
      },
      "company": "TransUnion",
      "website": "https://www.transunion.com/"
    },
    {
      "name": "ZS Associates",
      "location": "Evanston, IL",
      "description": "",
      "position": "IT Operations Assistant",
      "url": "https://www.zs.com/",
      "startDate": "2012-10-01",
      "endDate": "2013-05-01",
      "summary": "Tools & Technology: MS Office Suite, Internal Inventory Management Systems",
      "highlights": [
        "Acted as the first point of contact for technical support, assisting users with software and hardware issues on a daily basis.",
        "Provided prompt and efficient resolution to user inquiries, ensuring minimal disruption to their workflow.",
        "Setup and configured cell phones, laptops, iPads, and other hardware, ensuring smooth operation and user satisfaction.",
        "Supported IT department initiatives, including roll-outs and hardware updates, contributing to the overall improvement of IT infrastructure and operations."
      ],
      "isCurrentRole": false,
      "start": {
        "year": 2012,
        "month": 10
      },
      "end": {
        "year": 2013,
        "month": 5
      },
      "company": "ZS Associates",
      "website": "https://www.zs.com/"
    },
    {
      "name": "Kirkland & Ellis LLP",
      "location": "Chicago, IL",
      "description": "",
      "position": "Litigation Project Assistant",
      "url": "https://www.kirkland.com/",
      "startDate": "2011-05-01",
      "endDate": "2012-05-01",
      "summary": "Tools & Technology: MS Office Suite, Relativity, Document Management Systems",
      "highlights": [
        "Edited and proofed legal correspondence, court memoranda, and briefs, ensuring accuracy and adherence to established standards.",
        "Organized and tracked proceedings using databases such as Autonomy and Relativity, ensuring efficient document management and easy retrieval of information.",
        "Conducted research and prepared documentation for attorney team review, contributing to the development of compelling legal strategies.",
        "Coordinated projects to streamline work processes within larger team workflows, promoting efficiency and collaboration."
      ],
      "isCurrentRole": false,
      "start": {
        "year": 2011,
        "month": 5
      },
      "end": {
        "year": 2012,
        "month": 5
      },
      "company": "Kirkland & Ellis LLP",
      "website": "https://www.kirkland.com/"
    },
    {
      "name": "IES Abroad",
      "location": "Chicago, IL",
      "description": "",
      "position": "Production Assistant",
      "url": "https://www.iesabroad.org/",
      "startDate": "2010-06-01",
      "endDate": "2011-04-01",
      "summary": "Tools & Technology: MS Office Suite",
      "highlights": [
        "Cataloged inventory of marketing brochures, education catalogs, and business reports, ensuring accurate tracking and easy access to materials.",
        "Maintained high-speed Canon and HP printers, fax machines, and copiers, ensuring their optimal performance and addressing any technical issues that arise.",
        "Processed and managed outgoing and incoming mail, packages, and marketing materials, ensuring timely delivery and efficient workflow."
      ],
      "isCurrentRole": false,
      "start": {
        "year": 2010,
        "month": 6
      },
      "end": {
        "year": 2011,
        "month": 4
      },
      "company": "IES Abroad",
      "website": "https://www.iesabroad.org/"
    }
  ],
  "publications": [
    {
      "name": "CICD pipeline for software development",
      "publisher": "trustradius",
      "releaseDate": "2017-01-16",
      "url": "https://www.trustradius.com/reviews/travis-ci-2017-01-13-10-25-58?utm_medium=email&utm_source=transactional&utm_campaign=review-published",
      "summary": "",
      "website": "https://www.trustradius.com/reviews/travis-ci-2017-01-13-10-25-58?utm_medium=email&utm_source=transactional&utm_campaign=review-published"
    }
  ],
  "education": [
    {
      "institution": "Free Code Camp",
      "url": "https://www.freecodecamp.org/",
      "area": "Computer Software Engineering",
      "studyType": "Full Stack Web Development Certification",
      "startDate": "2016-12-01",
      "endDate": "2016-12-01",
      "score": "",
      "courses": [],
      "description": "",
      "activities": "",
      "start": {
        "year": 2016,
        "month": 12
      },
      "end": {
        "year": 2016,
        "month": 12
      },
      "website": "https://www.freecodecamp.org/",
      "gpa": ""
    },
    {
      "institution": "DePaul University",
      "url": "https://www.cdm.depaul.edu/Pages/default.aspx",
      "area": "Computer Science",
      "studyType": "Master of Science (M.S.)",
      "startDate": "2012-12-01",
      "endDate": "2014-12-01",
      "score": "3.7",
      "courses": [
        "CSC 536 - Distributed Systems II",
        "CSC 447 - Concepts of Programming Languages",
        "CSC 421 - Applied Algorithms and Structures",
        "CSC 373 - Computer Systems I",
        "CSC 578 - Neural Networks and Machine Learning",
        "CSC 435 - Distributed Systems",
        "CSC 438 - Framework for Web Application Development",
        "CSC 555 - Mining Big Data",
        "CSC 352 - Database Programming",
        "CSC 374 - Computer Systems II",
        "SE 450 - Object-Oriented Software Development",
        "CSC 552 - Concurrent Software Development",
        "CSC 453 - Database Technologies",
        "CSC 202 - Discrete Structures for Computer Science",
        "CSC 500 - Research Colloquium",
        "CSC 383 - Data Structures and Algorithms in Java"
      ],
      "description": "",
      "activities": "",
      "start": {
        "year": 2012,
        "month": 12
      },
      "end": {
        "year": 2014,
        "month": 12
      },
      "website": "https://www.cdm.depaul.edu/Pages/default.aspx",
      "gpa": "3.7"
    },
    {
      "institution": "College of Lake County",
      "url": "https://www.clcillinois.edu/",
      "area": "Computer Programming",
      "studyType": "Continuing Professional Development",
      "startDate": "2010-12-01",
      "endDate": "2012-12-01",
      "score": "",
      "courses": [
        "EITP1211 - Introduction to Programming",
        "EWEB1010 - Creating Web Pages",
        "EPY30412 - Introduction to Python 3 Programming",
        "EJAB0512 - Introduction to Java Programming"
      ],
      "description": "",
      "activities": "",
      "start": {
        "year": 2010,
        "month": 12
      },
      "end": {
        "year": 2012,
        "month": 12
      },
      "website": "https://www.clcillinois.edu/",
      "gpa": ""
    },
    {
      "institution": "University of Iowa",
      "url": "https://uiowa.edu/",
      "area": "English, Mass Communications",
      "studyType": "Bachelor of Arts",
      "startDate": "2004-12-01",
      "endDate": "2008-12-01",
      "score": "3.0",
      "courses": [],
      "description": "",
      "activities": "",
      "start": {
        "year": 2004,
        "month": 12
      },
      "end": {
        "year": 2008,
        "month": 12
      },
      "website": "https://uiowa.edu/",
      "gpa": "3.0"
    },
    {
      "institution": "Lake Forest High School",
      "url": "",
      "area": "General",
      "studyType": "High School Diploma",
      "startDate": "2000-12-01",
      "endDate": "2004-12-01",
      "score": "",
      "courses": [],
      "description": "",
      "activities": "",
      "start": {
        "year": 2000,
        "month": 12
      },
      "end": {
        "year": 2004,
        "month": 12
      },
      "website": "",
      "gpa": ""
    }
  ],
  "volunteer": [
    {
      "organization": "Chicago Public Schools",
      "position": "Early College STEM (ECSS) Mentor",
      "url": "",
      "startDate": "2015-03-01",
      "endDate": "2016-06-01",
      "summary": "ECSS connects high school, college, and the world of work through dynamic partnerships and pioneers a new vision for college and career readiness. With a unique 9-14 model, students will receive an associate's degree a six year time frame. CPS, the City Colleges and our corporate sponsors will work together to ensure that students have an opportunity to pursue a career in technology and gain skills for the 21st century workforce, enabling them to realize their full potential.",
      "highlights": [],
      "location": "Chicago, IL",
      "start": {
        "year": 2015,
        "month": 3
      },
      "end": {
        "year": 2016,
        "month": 6
      },
      "website": ""
    },
    {
      "organization": "Lake Forest Open Lands Association",
      "position": "Volunteers for Open Lands Education Services (V.O.L.E.S)",
      "url": "",
      "startDate": "2011-03-01",
      "endDate": "2014-05-01",
      "summary": "A private not-for-profit corporation and land trust that supports land preservation and conservation through educational and community programs and events.\n\nhttp://www.lfola.org/getinvolved/teachaclass.aspx",
      "highlights": [],
      "location": "Lake Forest, IL",
      "start": {
        "year": 2011,
        "month": 3
      },
      "end": {
        "year": 2014,
        "month": 5
      },
      "website": ""
    },
    {
      "organization": "Peace Corps",
      "position": "Education Volunteer",
      "url": "",
      "startDate": "2008-08-01",
      "endDate": "2009-11-01",
      "summary": "- Researched educational development techniques and applied techniques to educational instruction with local teacher counterpart.\n- Communicated Peace Corps goals and initiatives to Kazakh community members which included journalists, politicians, teachers and law enforcement officials.\n- Created and organized a digital English language laboratory with English language work books, computers, and an Interactive Smart Board.",
      "highlights": [],
      "location": "Chernoye, Kazakhstan",
      "start": {
        "year": 2008,
        "month": 8
      },
      "end": {
        "year": 2009,
        "month": 11
      },
      "website": ""
    }
  ],
  "awards": [],
  "languages": [
    {
      "language": "English",
      "fluency": "Native Speaker"
    },
    {
      "language": "German",
      "fluency": "Elementary"
    },
    {
      "language": "Russian",
      "fluency": "Elementary"
    },
    {
      "language": "Spanish",
      "fluency": "Elementary"
    }
  ],
  "interests": [],
  "references": [],
  "certificates": [
    {
      "name": "Functional Programming Principles in Scala",
      "issuer": "Coursera Verified Certificates",
      "date": "2014-06-01",
      "url": "",
      "summary": "",
      "website": ""
    },
    {
      "name": "The Data Scientist’s Toolbox",
      "issuer": "Coursera",
      "date": "2014-08-01",
      "url": "",
      "summary": "",
      "website": ""
    },
    {
      "name": "Relativity Certified Administrator (RCA)",
      "issuer": "kCura",
      "date": "2014-09-01",
      "url": "",
      "summary": "",
      "website": ""
    },
    {
      "name": "Web Application Architectures",
      "issuer": "Coursera Verified Certificates",
      "date": "2014-09-01",
      "url": "",
      "summary": "",
      "website": ""
    },
    {
      "name": "Learn Java Course",
      "issuer": "Codecademy",
      "date": "2016-03-01",
      "url": "",
      "summary": "",
      "website": ""
    },
    {
      "name": "Learn AngularJS 1.X Course",
      "issuer": "Codecademy",
      "date": "2015-11-01",
      "url": "",
      "summary": "",
      "website": ""
    }
  ],
  "meta": {
    "note": "This is a combined version of the old and new JSON Resume API to provide maximum compatibility. You will notice duplicated values in different fields.",
    "canonical": "https://raw.githubusercontent.com/jsonresume/resume-schema/master/resume.json",
    "version": "v1.0.0",
    "lastModified": "2020-12-29T15:53:00"
  }
}